Repository: Lilium27/Creating-Intelligent-Content-with-Lightweight-DITA-Translation-Project
Catalog: omegat/project_save.tmx
Source language: en
Languages: zh_cn

source: TABLE 2.1 Excerpt from the “Clarity” requirement of Producing Technical Information, which compares “weak verbs” to “strong, precise verbs” and “roundabout expressions” to “concise terms” (Dean et al., 1983, p.
zh_cn: 表格 2.1 摘自《产出技术信息》对“明确性”的要求，将“弱动词”与“强而精确的动词”相比较，将“迂回表达”与“简明术语”相比较(Dean et al., 1983, p.

source: TABLE 2.2 Attempt to map the essential moves of technical communication from the
zh_cn: TABLE 2.2 试图在ELI Review课程的技术传播基本文步和

source: TABLE 3.2 Specialized structural elements in XDITA and their equivalents in HDITA, which use custom data attributes to modify elements in HTML5.
zh_cn: 表 3.2 表中展示了XDITA 和 HDITA 中的专门化结构元素，其中，HDITA 可以使用自定义数据属性来修改 HTML5 中的元素。

source: THE ABSTRACTIONS BEHIND INTELLIGENT CONTENT
zh_cn: 智能内容背后的抽象概念

source: THE LwDITA INITIAL AUTHORING FORMATS
zh_cn: LwDITA初始创作格式

source: THE LwDITA MAP COMPONENTS
zh_cn: LwDITA 地图组件

source: THE LwDITA TOPIC COMPONENTS
zh_cn: LwDITA 话题组件

source: Table 1 shows a list of “weak verbs” and “roundabout expression” compared to “strong, precise verbs” and “concise terms” from the “Write directly and economically” recommendation under the requirement of “Clarity.”
zh_cn: 表格 1 是一个“弱动词”和和“迂回表达”的列表，与之形成对比的是“明确性”要求下的“直接而经济地写作”所使用的“强而精确的动词”和“简洁的术语。”

source: Table Components
zh_cn: 表格组件

source: Table entry: a single cell within a table.
zh_cn: 表条目：表格中的单元格。

source: Table header: an optional single heading row at the beginning of a table.
zh_cn: 表头：表格头部的可选单行标题。

source: Table row: a single row within a table.
zh_cn: 表格行：表格中的行。

source: Table: a collection of rows and entries to present organized content.
zh_cn: 表格：展示有组织的内容的行和条目。

source: Taken to its most dangerous extreme, this obsession with order and rules can lead to the standardization of cultural products that Theodor Adorno (1991) presaged.
zh_cn: 对秩序与规则的痴迷到达危险的极端状态时，可能会导致狄奥多·阿多诺（Theodor Adorno）所预言的文化产品标准化的后果(1991) 。

source: Task orientation
zh_cn: 任务导向

source: Task: includes procedures (“how to” information)
zh_cn: 任务（task）：包括步骤（指南信息）

source: Teachers and trainers who want to create course content for a web site or learning management system (LMS)
zh_cn: 希望为web站点或学习管理系统(LMS)创建课程内容的教师和培训师

source: Technical communication consultants and practitioners frequently report on success stories and challenge narratives from implementing and managing XML-based content projects in conferences like DITA/Content Management Strategies and LavaCon.
zh_cn: 在 DITA 和内容管理策略、LavaCon 这样的会议上，技术传播顾问和从业者经常发表关于实现和管理基于 XML 的内容项目的演讲，探讨成功案例和遇到的挑战。

source: Technical editors who need to incorporate Markdown files in DITA or XDITA topic collections
zh_cn: 需要合并使用DITA或XDITA主题集的 Markdown文件的技术编辑

source: Technical editors, who can focus on word choice, grammar, and overall organization
zh_cn: 技术编辑，关注选词，语法和整体架构

source: Technical writers with some XML experience
zh_cn: 有一些XML经验的技术作者

source: Template designer, who establishes the look and feel of content deliverables
zh_cn: 模板设计师，设计可交付成果的界面和风格

source: Test it again
zh_cn: 再次验证

source: That approach is based on a sequence of layers of abstraction that supersede (and actually include) a technical writing process focused on document production.
zh_cn: 该方法基于一系列抽象层级，这些抽象层取代（实际上是包括）了专注于文档生产的技术写作过程。

source: That authors can view content as non-linear and envision more than one outcome based on principles of reuse and single-sourcing might sound like a major innovation to professionals in academia and industry accustomed to using a word processor as their main tool.
zh_cn: 作者可以将内容视为非线性的，基于内容复用和同源开发的原则设想多个结果，这对于习惯将文字处理软件作为主要工具的学术界和工业界的专业人士来说，可能是一个重大的创新。

source: That generic LwDITA topic can also accommodate enough components and attributes to create content that sticks to the requirements of “modular, structured, reusable, format free, and semantically rich and, as a consequence, discoverable, reconfigurable, and adaptable” presented by Rockley et al.
zh_cn: 通用的 LwDITA 话题也可以容纳足够多的组件和属性，以创建符合罗克利等人提出的“模块化、结构化、可重用、格式自由、语义丰富，因而可发现、可重构和可修改”的要求的内容。

source: That means that including an HTML5 element that is not allowed in HDITA, like <aside> or <details>, would produce a validation error in LwDITA-aware tools.
zh_cn: 这意味着如果在HDITA中包含禁用的HTML5元素，如 <aside> or <details>，会支持LwDITA的工具会产生验证错误。

source: That means that including a Markdown component that is not allowed in MDITA extended profile, like the level-three heading I mentioned earlier, would produce a validation error in LwDITA- aware tools.
zh_cn: 这意味着包含MDITA扩展配置文件中禁用的Markdown组件(如我前面提到的第三级标题)在支持 LwDITA的工具中将产生验证错误。

source: That message was followed, on March 20, 2012 by the first Lightweight DITA proposal, also known as proposal 13076, presented by Michael Priestley to the OASIS DITA Technical Committee.
zh_cn: 2012年3月20日，迈克尔·普里斯特利y向 OASIS DITA 技术委员会提交了第一个轻量级 DITA 提案，也被称为第 13076 号提案。

source: That model also reflects our academic privilege as college professors whose students did not have real workplace expectations and deadlines: as we taught these layers in fictional scenarios, our students did not have the pressure from actual customers/users, managers, and subject matter experts that technical communicators face in the workplace.
zh_cn: 这种模式也反映了学术特权，作为大学教授，我们的学生不受工作要求和时间的限制，当我们在虚构的场景中教授抽象层级时，学生不用面对来自客户/用户、主管、主题专家的实际压力，而这是技术传播工程师在工作中必须要面对的。

source: That one-line command combines the map with the topics, processing the hierarchies and relationships established by the topic
zh_cn: 该单行命令将地图与话题组合在一起，处理由话题引用建立的

source: That process of specialization, with some limitations in HDITA and MDITA, is allowed in LwDITA.
zh_cn: LwDITA 可以实现这种专门化，尽管在 HDITA 和 MDITA 中有一些限制。

source: That same author could, with some tweaking of XML schemas or with help from an information architect, adapt the task topic to make the “fixed pattern or template” mentioned by Johnson into something that works for them.
zh_cn: 同一作者可以对XML模式进行一些调整，或者在信息架构师的帮助下，调整任务主题，使得约翰逊提到的“固定的模式会模板”能够转换成对他们行之有效的形式。

source: That same colleague would also point out examples of independent software companies that still produce lengthy user manuals.
zh_cn: 这批同时还会指出一些实例，证明现在仍有独立的软件公司会制作篇幅冗长的用户手册。

source: That simplification makes it possible to implement DITA without XML 一 for example using Markdown, or HTML5.
zh_cn: 轻量级 DITA 可以实现在不使用 XML 的情况下创建 DITA，比如使用 Markdown 或 HTML5。

source: That sure has been the case with LwDITA as an evolution of DITA XML.
zh_cn: 作为 DITA XML 的一种变体，LwDITA 就是这样发展而来。

source: That technical writer was Michael Priestley, who a few years later co-wrote (with JoAnn Hackos) the original technical specification for the DITA standard and is currently co-writing (with me) the spec for LwDITA.
zh_cn: 这位技术文档工程师就是迈克尔·普里斯特利（Michael Priestley），几年后他与乔安·哈克斯（JoAnn Hackos）共同为DITA标准创建了原始的技术规范，现在则同我一道在为轻量级DITA创建技术规范。

source: That's up to you)” (Price, 1984, p.100).
zh_cn: 它的效用取决于你)” (Price, 1984, p.100).

source: That's when a standard like DITA can help.
zh_cn: 这时，像 DITA 这样的标准就可以派上用场了。

source: The LwDITA ideal user is someone who already works in HTML or Markdown and could adopt (or not) a simple XML grammar that does not contain hundreds of element types.
zh_cn: LwDITA 的理想用户是使用 HTML 或 Markdown 并可以使用（或不使用）简单 XML 语法（不用包含数百种元素类型）的人。

source: The 12-page white paper dedicated some 70 words to describe some “strengths” of DITA (increase in content reuse, reduction in localization costs, and reduction in desktop publishing costs).
zh_cn: 这份12页的白皮书用大约70个词描述了 DITA 的“优势”（增加内容复用、降低本地化成本和降低桌面发布成本等）。

source: The <task> element opens the topic announcing “this is a task,” and it contains elements like the following:
zh_cn: <task>开启一个话题，声明“这是一个任务”，它包含如下元素：

source: The Sensei Sushi content repository includes many files that provide information for different audiences and contexts.
zh_cn: Sensei Sushi 内容库包括许多为不同受众和语境提供信息的文件。

source: The <map> element works as a parent for <topicref> elements that reference specific topics.
zh_cn: <map> 元素是 <topicref> 元素的父级元素，用于引用特定的话题。

source: The <nav> element works as a parent for <li> elements that reference specific topics.
zh_cn: <nav> 元素是 <li> 元素的父级元素，用于引用特定的话题。

source: The <topicmeta> element at the map level (in bold font) provides the main title (<navtitle>) for deliverables produced with this specific map.
zh_cn: 地图级别的 <topicmeta> 元素（粗体）为使用该特定地图生成的可交付内容定义了主标题( <navtitle>)。

source: The topics from the first book are not the same topics in the second book.
zh_cn: 第一本书中的主题与第二本书中的主题不一样。

source: The element at the map level (in bold font) provides the main title for deliverables produced with this specific map.
zh_cn: 地图级别的 元素（粗体）为使用该特定地图生成的可交付内容定义了主标题。

source: The Abstractions Behind Intelligent Content 151 near future, as even the smallest content unit (a Microsoft Word file today) can grow to become a complex repository (1000 pages of unstructured content with hundreds of tasks, frequently-asked questions, and product descriptions, for example).
zh_cn: 未来即使是最小的内容单元（今天的 Microsoft Word 文件）也可以发展为复杂的内容库（如包含数百个任务、常见问题和产品描述的1000页非结构化内容），独立作者也是如此。

source: The Abstractions Behind Intelligent Content 153 posts, compiling “the blog posts into a digest post of the top ‘X' things you need to know,” extracting “key quotes and tweet them,” and taking “the same questions, post them to Facebook, and start a conversation” (Rockley, 2016).
zh_cn: 再将“多篇博客汇编为一篇摘要，向读者介绍他们最需要知道的行业洞察”，提取“关键引用发送推特,”以及“将研讨会上的问题发在Facebook上，发起讨论” (Rockley, 2016)。

source: The April 4, 2017 edition of The New York Times featured a story titled “Learning to Think Like a Computer,” which contributed to introducing the concept of computational thinking to mainstream audiences.
zh_cn: 2017年4月4日，《纽约时报》刊登了一篇题为《学会像电脑一样思考》（Learning to Think Like a Computer）的文章，向主流观众介绍计算思维。

source: The DITA 1.3 technical specification, released in 2015, did not include element types to represent audio and video content natively in DITA tags (vendors and users developed their own solutions with the <object> tag or with HTML5 code snippets).
zh_cn: 在2015年发布的 DITA 标准1.3版本的技术规范中，没有直接可以在 DITA 标签中表示音频和视频的元素类型（供应商和用户自己解决了该问题：使用 <object> 标签或 HTML5 代码片段）。

source: The DITA DTDs (Document Type Definitions) and schemas mentioned in Hackos's description are files that validate (i.e., verify that a topic conforms with the DITA syntax rules) content created according to the DITA standard.
zh_cn: 在Hackos的描述中提到的DITA DTDs（文档类型定义）和模式是验证（验证）的文件。

source: The DITA Open Toolkit (DITA-OT) is an implementation of the OASIS DITA Technical Committee's specification for DITA DTDs and schemas.
zh_cn: DITA Open Toolkit (DITA-OT)是OASIS DITA技术委员会的DITA DTDs和模式规范的一个具现。

source: The DITA Technical Committee at OASIS released a white paper/committee note titled DITA 1.3: Why Three Editions?
zh_cn: OASIS的DITA技术委员会发布了一份白皮书/委员会说明，名为《DITA 1.3: 为什么划分三版?》

source: The DITA Technical Committee describes the three editions as follows:
zh_cn: DITA技术委员会对这三个版本的描述如下:

source: The DITA Technical Committee explained that separating the DITA 1.3 spec in three editions sets “the stage for future developments: Lightweight DITA and DITA 2.0” (Eberlein et al., 2015, p.
zh_cn: DITA技术委员会解释说，将DITA 1.3规范划分为三个版本为“未来的开发奠定了基础：轻量级DITA和DITA 2.0” (Eberlein et al., 2015, p.

source: The DITA map has a <title> element for the whole project.
zh_cn: DITA地 图有一个<title> 元素用于描述整个项目。

source: The DITA-OT automatically generated a navigation menu (figure 1.7) and took care of basic layout.
zh_cn: DITA-OT 会自动生成一个导航菜单（图1.7） ，并负责基本的布局。

source: The DITA-OT documentation website4 includes a list of the output formats supported by the toolkit.
zh_cn: DITA-OT 文档网站4列出了 DITA-OT 支持的生成格式。

source: The DITA-OT generated the menu and took care of basic layout for this web deliverable.
zh_cn: DITA-OT 生成了菜单，并负责该网页交付物的基本布局。

source: The GFM spec defines paragraph as a “sequence of non-blank lines” (GitHub Flavored Markdown Spec, 2017).
zh_cn: GFM 规范将段落定义为“非空行序列”（GitHub 风格 Markdown 规范，2017）。

source: The HDITA Map
zh_cn: HDITA 格式的地图

source: The HDITA version of the paragraph, seen in Figure 6.15, looks pretty similar to its XDITA counterpart.
zh_cn: 图 6.15中展示了HDITA版的段落组件，与 XDITA 中的非常相似。

source: The HTML5 semantic tag of <article> provides a content environment similar to the <topic> component from XDITA.
zh_cn: HTML5 的语义标签 <article> 的提供了类似于 XDITA 中 <topic> 组件的内容环境。

source: The IM types correspond to section types in DITA, and so match perfectly with the lightweight model's focus on creating topic types by assembling predefined section types.
zh_cn: IM 类型对应于 DITA 中的节（section）类型，因此与轻量级模型非常匹配，二者都是通过组合预定义的节类型来创建话题类型。

source: The IM white paper implied that authors had to “learn hundreds of DITA tags and attributes to structure the content correctly.
zh_cn: IM 白皮书暗示，作者必须“学习数百个 DITA 标签和属性，以便正确地将内容结构化，

source: The ISTE Standards for Students, which have the overall goal to “promote future-ready learning,” focus on the following dimensions:
zh_cn: ISTE 学生标准的总体目标是“促进学习，迎接未来”，该标准侧重于以下几个方面：

source: The ISTE indicators for assessing the dimension of computational thinker can be related to the main characteristics of intelligent content and, eventually, to the layers of abstraction behind content developed in a LwDITA workflow.
zh_cn: 用于评估计算机思维各维度的ISTE指标与智能内容的主要特征有关，归根结底与智能内容背后的抽象层级有关，而智能内容正是在LwDITA工作流中开发的。

source: The Information Mapping website gives the following historical description of the method (and company):
zh_cn: IM 网站对该方法（和公司）的历史介绍如下：

source: The Information Mapping website now simply defines it as “a research-based method for writing clear and user focused information, based on the audience's needs and the purpose of the information” (About, n.d.).
zh_cn: 信息映射官网现在简单地将其定义为“一种以研究为基础的方法，基于受众需求和信息目的，编写清晰的、以用户为中心的信息”（“关于”页面，未注明日期）。

source: The Introduction should also note any documentation conventions used in the manual (all caps means that words should be coded exactly as printed, lower case describes a user entry point, braces represent a mandatory choice, brackets represent optional parameters, etc.) Rigo added that if “the system does not function as described, users will quickly lose faith in the manual.
zh_cn: 简介同样应当注明手册中使用的文档惯例（全字母大写意味着该词应同印刷品采用相同的编码格式、小写代表用户入口、花括号代表必选项而方括号代表可选参数等。）里戈补充到，如果“系统没有按照描述的运行，用户很快就会对手册失去信任。”

source: The Lightweight DITA Subcommittee
zh_cn: 轻量级 DITA 小组委员会

source: The Lightweight DITA subcommittee at OASIS expects that after the standard is released more tool developers will incorporate LwDITA workflows and templates into existing platforms for writing in XML, HTML5, and Markdown (who knows .
zh_cn: OASIS的轻量级DITA小组委员会希望在该标准发布后，更多的工具开发人员将把LwDITA工作流和模板合并到现有的平台中，以便用XML、HTML5和Markdown编写（谁知道 .

source: The Lightweight DITA subcommittee at OASIS is, as of this writing, working on recommendations for handling instances of non-MDITA Markdown structures in MDITA core profile.
zh_cn: 在撰稿时，OASIS的轻量级DITA小组委员会正致力于研究如何在MDITA核心概要中处理非MDITA的Markdown结构实例。

source: The Lightweight DITA subcommittee at OASIS will release recommendations and standards for that validation, but will not produce tools or files to enforce it, leaving the implementation to interested vendors and developers.
zh_cn: OASIS 轻量级 DITA 小组委员会将发布验证标准，并给出建议，但不会开发用于验证的工具或文件，其具体实现将留给对此感兴趣的供应商和开发人员。

source: The Lightweight DITA subcommittee had its first teleconference call on September 15, 2014.
zh_cn: 轻量级 DITA 小组委员会在2014年9月15日举行了第一次电话会议。

source: The LwDITA map to create the Sensei Sushi brochure can be represented in the three initial LwDITA authoring formats, as I explain in the following sections.
zh_cn: 用于创建 Sensei Sushi 手册的 LwDITA 地图可以用三种最初的 LwDITA 写作格式来表示，我将在下面的部分中进行解释。

source: The LwDITA technical specification is the authoritative source for producing and processing content across the LwDITA authoring formats.
zh_cn: 《LwDITA 技术规范》是跨 LwDITA 写作格式生成和处理内容的权威来源。

source: The LwDITA topic and map can be represented, with some limitations and substitutions, in three authoring formats: XDITA (based on a simplified grammar of DITA XML), HDITA (based on HTML5), and MDITA (based on Markdown).
zh_cn: LwDITA 话题和地图可以用三种写作格式表示：XDITA（基于DITA XML的简化语法）、HDITA（基于HTML5）和MDITA（基于Markdown），不过有一些限制和需要替换的地方。

source: The LwDITA topic is also a versatile content unit that can be created in more than one markup language.
zh_cn: LwDITA 话题也是灵活的内容单元，可以用多种标记语言创建。

source: The LwDITA topic type (still a prototype at this stage) was moving away from the 27 XML tags promised in the summer of 2012.
zh_cn: LwDITA 话题类型（当时只是一个原型）已经与2012年夏天许诺的27 个 XML 标记渐行渐远。

source: The LwDITA topic, even without specialization, can be all that these users need to structure and publish information.
zh_cn: 即使没有专门化过，LwDITA 话题也可以是这些用户用于结构化内容和发布信息的全部所需。

source: The MDITA Map
zh_cn: MDITA 格式的地图

source: The Markdown DITA plugin for the DITA Open Toolkit1, developed by the Finland-based programmer Jarno Elovirta, was released on February 2015 and made possible some of the ideas that Priestley and I, and then the whole subcommittee, had been proposing for integrating Markdown into DITA publishing workflows.
zh_cn: 这个工具是 DITA Open Toolkit1 的 Markdown DITA 插件，由芬兰程序员雅诺·艾洛维塔开发，并于2015年2月发布。我和普里斯特利以及整个小组委员会都提议将 Markdown 集成到 DITA 发布工作流中，而 Markdown DITA 插件让这个想法成为可能。

source: The October 1975 edition of Asterisk (the “Systems Documentation Newsletter” from the Association for Computing Machinery) included a glimpse of a technical manual's rhetorical conventions.
zh_cn: 1975年 10月 版的 Asterisk (计算机协会的“系统文档通讯”) 中就对修辞惯例做了简要的描述。

source: The Slow and Methodical Development of LwDITA
zh_cn: LwDITA 缓慢而又井然有序的发展历程

source: The Toolkit transforms DITA XML source content into deliverable formats such as PDF, HTML, and help systems.
zh_cn: Toolkit将DITA XML源内容转换为可交付的格式，如PDF、HTML和帮助系统。

source: The W3C XML recommendation states that an “element type has mixed content when elements of that type may contain character data, optionally interspersed with child elements” (W3C, 2008).
zh_cn: W3C XML推荐标准规定，元素类型中如果包含字符数据或插入子元素时，这种元素类型就包含混合内容。

source: The W3C recommendation for HTML explains the <dl> element as a “description list of zero or more term-description groups.
zh_cn: 在 W3C 对 HTML 的介绍中，W3C 将 <dl> 元素定义为 “由零个或多个术语述组组成的描述列表。

source: The XDITA Map
zh_cn: XDITA 格式的地图

source: The abstractions relevant to the creation of intelligent content with LwDITA introduced in this chapter are a combination of the semantic (process vs. object) model and the computer architecture levels.
zh_cn: 本章介绍了与使用 LwDITA 创建智能内容相关的抽象能力，它结合了上文提到的语义（过程 vs. 对象）模型和计算机体系结构层级。

source: The all-inclusive edition incorporates content types from the DITA learning and training specialization (learning assessment, learning base, learning content, learning overview, learning plan, and learning summary).
zh_cn: 全能版包含了来自DITA学习和培训专门化的内容类型(学习评估、学习基础、学习内容、学习概述、学习计划和学习总结)。

source: The architecture will provide:
zh_cn: 该体系结构将提供如下功能：

source: The article acknowledged that computational thinking is not necessarily a new term, and that it was used by educator and mathematician Seymour Papert “in 1980 to envision how children could use computers to learn” (Pappano, 2017).
zh_cn: 文章表示，计算思维不是一个新术语，西摩·佩特（Seymour Papert）是一名教育家和数学家，他在1980年就使用计算思维来“构想儿童可以如何使用计算机进行学习” (Pappano, 2017)。

source: The article emphasized that DITA was more than just an XML DTD (Document Type Definition) for structuring documents.
zh_cn: 本文强调DITA不仅仅是结构化文档的XML DTD(文档类型定义)。

source: The article started by acknowledging that XML “has gained popularity in the technical writing profession by offering us a logical and fairly straightforward framework for developing structured information” (Priestley et al., 2001, p.
zh_cn: 这篇文章首先承认，XML“为开发结构化信息提供了一种逻辑和相当直接的框架，从而在技术写作行业中流行起来”。 (Priestley et al., 2001, p.

source: The assigned @id should be included in an optional YAML1 front matter header.
zh_cn: 话题的指定 @id 应该包含在可选 YAML1前置块头部。

source: The assigned @id will be attached to the topic even if the authors rename the source file (with the default “slugify” process of MDITA core profile, renaming a file will change its automatically- generated @id).
zh_cn: 即使作者重命名源文件，指定的 @id 不会改变 （按照 MDITA 核心规定，如果是自动解析生成的 @id，重命名文件将改变其名称）。

source: The authors did not present them as, say, the official rhetorical conventions for manuals at IBM. Jonathan Price, however, did move beyond the generic conventions and crossed into the organizational or institutional type of topical convention in his 1984 book How to Write a Computer Manual: A Handbook of Software Documentation.
zh_cn: 作者并没有把它们作为，比如说，IBM手册的官方修辞惯例。乔纳森·普莱斯（Jonathan Price）在他1984年出版的《如何编写计算机手册：软件文档手册》的确从通用惯例的基础上往前迈了一步，开创了组织机构型主题惯例。.

source: The body of a LwDITA topic can also contain topical conventions for lists.
zh_cn: LwDITA 话题主体还可以嵌套话题协定中的列表组件，

source: The brochure will include the following sections (each section will be in a separate LwDITA topic):
zh_cn: 手册将包括以下部分（每个部分都是一个单独的 LwDITA 话题）：

source: The characteristics of intelligent content set the foundation for assessing computational thinking, based on the ISTE indicators, in the domains of technical communication and content authoring.
zh_cn: 智能内容的特性为在技术传播和内容创作领域基于 ISTE 指标评价计算机思维奠定了基础。

source: The combination of XML, HTML5, and Markdown in the initial LwDITA authoring formats enhances the diversity of authors in a DITA- like environment, but it also represents challenges for compatibility and equivalency of models and structures.
zh_cn: 在 LwDITA 最初的写作格式中，XML、HTML5 和 Markdow n的组合提升了类 DITA 环境中作者的多样性，但也带来了对模型和结构的兼容性和对等性的挑战。

source: The combination of big-picture requirements and concrete recommendations responds to PQTI's dual audience.
zh_cn: 全局性的要求与具体的建议相结合使得 PQTI满足了两类读者的需求。

source: The command has the reference to the built-in (bin) subdirectory and the dita executable program, with the marinara-critique.ditamap file as input, and html5 as the delivery format.
zh_cn: 该命令引用了内置（bin）子目录和 dita 可执行程序，将 marinara-critique.ditamap 文件作为输入，html5作为输出物格式。

source: The committee note Lightweight DITA: An Introduction explains that the LwDITA topic includes a subset of conventions or components (the pigeonhole structures mentioned in Chapter 2) that were “carefully chosen to include only the most basic constructions that are needed to structure information effectively.” To select those components, the subcommittee “considered the needs of diverse industries and sectors (including education, engineering, healthcare, and marketing)” (Evia et al., 2018, p.
zh_cn: 委员会白皮书《轻量级DITA简介》解释到，LwDITA话题包括一个协定或组件（即在第2 章中提到的鸽笼式结构）的子集，它们“经过委员会的精心挑选，只包括最基础的必要结构，用以有效构造信息。”为了挑选组件，小组委员会"考虑了不同行业和部门（包括教育、工程、医疗保健和营销等领域）的需求"(艾维亚等人，2018年，第

source: The committee note, titled “Lightweight DITA: An Introduction,” was edited by me, Eberlein, and Alan Houser, former president of the Society for Technical Communication, who joined the LwDITA subcommittee in 2017.
zh_cn: 白皮书名为《轻量级 DITA 简介》，由我、埃伯莱因和艾伦·豪泽编写。艾伦·豪泽是技术传播协会前主席，于2017年加入 LwDITA 小组委员会。

source: The component follows the same structure as its counterpart in XDITA.
zh_cn: 该组件与 XDITA 中的有序列表组件有着相同的结构。

source: The component includes one or more definition list entries, each with a definition term and a definition description.
zh_cn: 该组件包括一个或多个定义列表条目，每个条目都有一个定义术语和一个定义描述。

source: The concept of abstraction is also quite prevalent in the introductory literature to computing architecture.
zh_cn: 在关于计算机架构的入门书籍中，抽象的概念也非常普遍。

source: The concept of “what you see is what you get” (WYSIWYG) from many web developing editors does not translate to topic-based authoring in XML because a topic is just a component in a larger collection of chunks that need to be processed to create deliverables.
zh_cn: 许多网页开发编辑器提出的“所见即所得” (WYSIWYG) 的概念并不能应用到基于话题的 XML 写作中来，因为话题只是用于生成可交付成果的大块信息集合中的一个组件。

source: The content and organization of a user's guide, for example, is different from the content and organization of a reference manual.
zh_cn: 例如，用户指南的内容和组织不同于参考手册。

source: The content embraced by the XML tags requires proper capitalization and correct spelling according to any style guide developed or adopted by Chef Pedro and his team.
zh_cn: 这些内容需要根据厨师佩德罗及其团队制定或采用的风格指南适当修改，调整大小写以及修正拼写问题。
